{
  "company_name": "Top Choice Lawn Care",
  "url": "https://www.topchoiceaustin.com/",
  "about_text": "Lawn Care, Landscaping, and Irrigation - Austin's Best | Top Choice Lawn Care Skip to content (512) 291-7050 Free Fast Quote About The Team What is wrong with my yard? Frequently Asked Questions Customer Testimonials Landscaping Portfolio Landscaping Products Landscaping BlogLawnLandscaping Beds & Shrubs Sod & Grass Core Aeration Top Dressing Tree Trimming Mulch Fertilization & Weeds Bed Creation Planting Tree & Shrub Fertilization Patios & Rock Artificial TurfIrrigationHoliday LightsTrabajos/JobsFree Fast EstimateLogin Search (512) 291-7050  -  Get a Free Quote About The Team What is wrong with my yard? Frequently Asked Questions Customer Testimonials Landscaping Portfolio Landscaping Products Landscaping BlogLawnLandscaping Beds & Shrubs Sod & Grass Core Aeration Top Dressing Tree Trimming Mulch Fertilization & Weeds Bed Creation Planting Tree & Shrub Fertilization Patios & Rock Artificial TurfIrrigationHoliday LightsTrabajos/JobsFree Fast EstimateLogin Search Top Choice Lawn Care Lawn Care • Landscaping • Irrigation Get a free estimate A different kind of lawn care company Tired of cheap “cut ‘n run” lawn care services, inexperienced laborers, or companies who won’t call you back? We are too. At Top Choice Lawn Care, we believe everyone deserves quality service and exceptional customer service. It’s just that simple. 0+Reviews on Google 0+Reviews on Yelp Why Choose Top Choice Lawn Care? Services for your whole yard We can handle everything your turf, shrubs, and trees need to be healthy – and make your yard the yard of envy in the neighborhood. At Top Choice Lawn Care, our turf and landscaping experts will provide the best service you’ve experienced, or it’s free. Lawn Care Mowing Edging Blowing Fertilization Weed Control Landscaping Bed maintenance Trees Plants Sod Much more Irrigation Repairs Evaluations Routine Programs Installations Backflow Prevention Checks Get a free estimate We have fun doing great work We believe happy people do better work, and that makes customers happy too! We enjoy helping folks and having fun in the great outdoors. We offer reasonable prices, and we pay our folks well. We answer the phone. We do what we say we will do. We own and fix our mistakes (they happen). We’re always improving. We strive to do business with folks for decades, and that only happens when we treat people right. 5,000+ happy customers 19+ years in business Part veteran owned 50+ uniquely skilled team members Fully insured Uniformed crews Professional vehicles and gear No smoking onsite Lawn Care Solutions Come home to a beautiful lawn every day, with routine mowing, edging, and blowing services. Our turf experts also offer seasonal fertilization and weed control to keep your lawn looking its best year-round. Get a free estimate Our no contract guarantee We don't need contracts. We're only happy if you are! Our service area We serve most of south, central, and north Austin, including Bee Cave / Lakeway area, West Lake, Oak Hill, Circle C, and more. We recently expanded to serve north Austin, including Cedar Park, Round Rock, and beyond! This map provides a general idea of our service area, but if in doubt, give us a call! (Click to enlarge) Some of our Top Choice smiles We love to smile, and having fun is part of who we are. You can learn more about us on our team page. SimonMadman with a Mower / Christmas Lighting Legend AllisonEstimator Extraordinaire / Horticulture Phenom VanessaCustomer Service Manager / The Office Mom Meet the team This Week in Landscaping TL;DR: Weather: Cooler nights + warm days = turf recovery zone. Topdressing: Fall has a short, 2–3 week window — first week of October looks prime. Soil Health: Use nutrient-rich soil blends (not just compost). Aeration: Mechanical > liquid for Austin’s compact soils. FULL SCOOP HERE. Lawn care tips for every season Grow your skills (and your lawn) with tips, tricks, and resources unique to the challenges of central Texas lawn care. Washers and Horseshoes By The Top Choice Team | October 13, 2025 Let’s talk about yard games. I love them. Obsessed.  If I’m at a wedding reception and there’s cornhole or washers out… my wife knows she’s pretty much on her own for the rest of the night. (I know this is not good…sometimes I am actually a good husband).  And now for the fun part: Top… Read More » Top 10 Plants for Xeriscaping in Central Texas By Nolan Gore | October 7, 2025 1. Texas Sage (Leucophyllum frutescens) Type: ShrubSun Requirements: Full sunWatering Requirements: Drought-tolerant once established; requires minimal wateringMature Size: Typically reaches a height of 3-8 feet with a similar spread Fun Facts: 2. Red Yucca (Hesperaloe parviflora) Type: PerennialSun Requirements: Full sunWatering Requirements: Highly drought-tolerant; minimal watering once establishedMature Size: Typically grows to a height of 2-3 feet with a… Read More » Lawn Fertilization in Austin: Why, When, and How to Do It Right By The Top Choice Team | October 1, 2025 In Austin, fertilizing your lawn isn’t really that optional (unless you don’t want to have a nice yard).  Think of it as feeding your grass the right diet with the proper micro nutrients. Timing, product selection, and application matter a lot more than most people realize. Get it wrong, and you’re wasting money (or worse,… Read More » Explore our landscaping blog Get In Touch! (512) 291-7050 10081 Schmidt Lane Austin, TX 78737 Monday-Thursday, 8:30am-6pmFriday, 8:30am-2pmSaturday & Sunday closed About Us We are a customer service business that happens to do lawn care. We are owned and operated by Austinites committed to making our city beautiful and embracing our common appreciation for the great outdoors. Latest Posts Washers and Horseshoes Top 10 Plants for Xeriscaping in Central Texas Lawn Fertilization in Austin: Why, When, and How to Do It Right Get a Quote! Get a fast free quote from the Top Choice experts. Get a Quote © 2025 Top Choice Lawn Care. All Rights Reserved.  |  Powered by Blue Griffin Marketing\n\nThe Top Choice Lawn Care Team - Fun, Feisty, Fantastic Folks | Top Choice Lawn Care Skip to content (512) 291-7050 Free Fast Quote About The Team What is wrong with my yard? Frequently Asked Questions Customer Testimonials Landscaping Portfolio Landscaping Products Landscaping BlogLawnLandscaping Beds & Shrubs Sod & Grass Core Aeration Top Dressing Tree Trimming Mulch Fertilization & Weeds Bed Creation Planting Tree & Shrub Fertilization Patios & Rock Artificial TurfIrrigationHoliday LightsTrabajos/JobsFree Fast EstimateLogin Search (512) 291-7050  -  Get a Free Quote About The Team What is wrong with my yard? Frequently Asked Questions Customer Testimonials Landscaping Portfolio Landscaping Products Landscaping BlogLawnLandscaping Beds & Shrubs Sod & Grass Core Aeration Top Dressing Tree Trimming Mulch Fertilization & Weeds Bed Creation Planting Tree & Shrub Fertilization Patios & Rock Artificial TurfIrrigationHoliday LightsTrabajos/JobsFree Fast EstimateLogin Search The Top Choice Lawn Care Team Meet the fun and friendly people who make it all possible Top Choice employees enjoy their work. They laugh loud and often while striving to provide the best service and operate efficiently. Our crew members are directly responsible for the high-quality work done in every yard we visit. We are proud to have such an experienced and hard-working crew. Without these guys we could never provide you and your family with the expert lawn and landscaping services all of Austin has come to expect from us. The Top Choice Story Top Choice Lawn Care was founded in 2005 with the customer in mind. Throughout the years, the team has refined our processes, services, and area of operations and we now provide lawn care, landscaping, and irrigation to the greater part of West Austin as far north as Steiner Ranch and as far south as Buda. We are proud to be local and we are proud to be from Texas. We are veteran-owned and operated. It would be an honor to serve you. Our team NolanGeneral Manager / The Guy that tries to be funny in the emails Nolan was born and raised in Austin. The son of a landscape entrepreneur, he has been around the business since he can remember. Nolan attended Texas A&M university where he graduated with a finance degree and spent many Saturdays disappointed by the football team. After college, Nolan joined the Marine Corps as a combat engineer officer and moved to Virginia. Over four years, he and his wife – Joanie – lived on both coasts, and he served one tour in Iraq, and had other adventures. Nolan and his lovely wife have four rambunctious kids. He enjoys a good book, a hard workout, a close game, and his kids’ laughs. GoldenOperations Manager / The Guy That Actually Makes This Place Run Golden hails from a suburb of Salt Lake City.  He is the son of a small-town Idaho farmer.  He graduated twice from Brigham Young University – once as an undergraduate and once as a graduate.  For most of his professional career, he has been involved in sales and service management – overseeing sales professionals, service representatives, underwriters, and even technology resources.  He is our protocol and procedures guru.  Organizing and arranging materials, installations, safety processes – you name it.  In 2011, he moved to Austin to get his wife closer to home.  Shortly after arriving, he joined Top Choice and has loved being here.  Enough to become part owner! Golden is married to a perfect woman, has three girls and one boy and a couple of small dogs. JustinOperations / Fire Lord (He Puts Out Fire) Justin makes the trains run on time and does most of our nuts-and-bolts scheduling day to day. (So, if you’re ever annoyed at our scheduling, Justin’s direct phone line is…oh, wait…never mind…oops). When he isn’t arranging huge mulch deliveries or tracking down an exotic plant for your property, Justin also recruits, hires, trains, manages, coaches, etc – all our team. Justin was born and raised in Mexico and speaks fluent Spanish. He later came to the States and graduated from Brigham Young University. Before joining Top Choice, Justin worked in foreign-visa-program recruitment in the Houston Oil & Gas industry. He is happy to be in the green industry now. Justin is always humming or singing or whistling something and is notorious for getting a tune stuck in his head. He has two boisterous sons that keep him busy! JoeKing of the Drive Through / Ops Maestro Joe has a background in the restaurant space. Before joining Top Choice, he ran multiple Chic-fil-a stores in town. When he got tired of Chicken Sandwiches, he decided to try his hand at the lawn and landscape industry where he uses his vast experience with customer service and system efficiencies to make us better every day. ScottIrrigation/ Drip and Drop Master Scott has taken our irrigation department to the next level. He has over a decade of experience in the industry - starting in the field digging ditches. Through the years, he has moved through the industry with residential, commercial, and municipal experience. He even worked for the City of Austin for a while. When he isn’t watering the world (with the utmost of water conservation) he can be found rollerblading (he is a master) or helping folks in his neighborhood. We feel so thankful to have him on our team - teaching, coaching, managing our irrigators, and serving our customers. VanessaThe Office Mom / Customer Service Manager Vanessa is a local *gasp*. They actually exist. And she is one of those locals that has actually done the “Cool Austin Stuff” for a long time. Example: she faithfully attended ACL for many years before it reached national acclaim. She is a wonderful mom to two – dare we say – extremely smart kids. (A random conversation with the 10-year-old may involve the role of the American bill of rights…no joke). And she fills the much-needed role of mother to the office. She is calming and keeps things in perspective (for us and the customer). She is a natural gatherer – each weekend we hear of a family event she has planned. But it trickles into the office to when she organizes a potluck or celebrates a birthday. She is a valued member of the customer service team and if you call, text or email the office, you will likely get the opportunity to chat with Vanessa before long. Our Service Team (Great Folks On The Phones) John Imee Myra Estimators (Landscaping Gurus) AllisonEstimator Extraordinaire / Horticulture Phenom Allison is originally from Dallas (Don’t hold it against her). When she was a kid she loved extreme sports (I actually saw 3 skate boards in her car the other day – how on earth could you ever ride 3?!) She attended Texas A&M where she studied Horticulture. She finds viticulture (wine making) very fascinating and actually had several offers with vineyards up in the northwest. Before Top Choice, she worked for a well known tree company in the DFW area. She is one of those weird people that actually walks around plant nurseries for fun – she really likes plants. We love her because she is spunky and isn’t afraid to tell you what she thinks. She genuinely cares that customers get great service and she couples that with her love for the green industry. She is a team player and a fantastic estimator. You may catch her in your yard doing an estimate, or on the phone when you have a question. She’s a “Jack of all trades”, or should I say “Jane”? Formally, she is a certified arborist, so feel free to direct your tree questions her way. See her recognized on ISA here. SteveThe Gray Fox / \"Been there done that\" / Estimating Legend Steve has been doing landscaping and lawn care in Texas for over 30 years – most of it in Austin. He has spent time at a number of companies around town and has even run his own high-end maintenance company for a number of years. He is quick with a story about his grandmother and her begonias – Spoiler: Steve would save them in burlap sacks through the winter. He is extremely knowledgeable and friendly. If you ever get the chance, have him walk you around your yard – you won’t regret the information or the storiesOn the weekend you will find Steve laughing on the golf course (probably in a bunker). He may be with his buddies or with his birdie prone son (his son is reeeaaallly good). He has been married to his wonderful wife for 20 years (she is obviously a saint). Steve and his bride will eventually retire to a fishing boat in Florida where his daughter is currently in college. We are blessed and grateful to have Steve on the team. LisaThe one and only “Lady Landscaping” Lisa joined the team in early 2024. But that wasn’t the beginning of her adventures in landscaping. For several years she owned and operated her own company - and did much of the work herself. Since then, she has been a super mom, an elementary teacher, a school librarian and a realtor. We are grateful to have another capable and strong-willed lady grace our team (and put Nolan in his place). Join the Top Choice Lawn Care team! We have the best employees in the city. We pay well and value our workers. Click below to apply to join our crew, or if you are looking for a management or office position, please send your resume to service@topchoiceaustin.com with a note about your experience and why you are interested. Join our crew Get a fast free quote Our team loves to take care of our fellow Austinites and their lawns. Visit our quotes page to get a fast free estimate today. Get a free estimate Get In Touch! (512) 291-7050 10081 Schmidt Lane Austin, TX 78737 Monday-Thursday, 8:30am-6pmFriday, 8:30am-2pmSaturday & Sunday closed About Us We are a customer service business that happens to do lawn care. We are owned and operated by Austinites committed to making our city beautiful and embracing our common appreciation for the great outdoors. Latest Posts Washers and Horseshoes Top 10 Plants for Xeriscaping in Central Texas Lawn Fertilization in Austin: Why, When, and How to Do It Right Get a Quote! Get a fast free quote from the Top Choice experts. Get a Quote © 2025 Top Choice Lawn Care. All Rights Reserved.  |  Powered by Blue Griffin Marketing\n\nThe Top Choice Team, Author at Top Choice Lawn Care Skip to content (512) 291-7050 Free Fast Quote About The Team What is wrong with my yard? Frequently Asked Questions Customer Testimonials Landscaping Portfolio Landscaping Products Landscaping BlogLawnLandscaping Beds & Shrubs Sod & Grass Core Aeration Top Dressing Tree Trimming Mulch Fertilization & Weeds Bed Creation Planting Tree & Shrub Fertilization Patios & Rock Artificial TurfIrrigationHoliday LightsTrabajos/JobsFree Fast EstimateLogin Search (512) 291-7050  -  Get a Free Quote About The Team What is wrong with my yard? Frequently Asked Questions Customer Testimonials Landscaping Portfolio Landscaping Products Landscaping BlogLawnLandscaping Beds & Shrubs Sod & Grass Core Aeration Top Dressing Tree Trimming Mulch Fertilization & Weeds Bed Creation Planting Tree & Shrub Fertilization Patios & Rock Artificial TurfIrrigationHoliday LightsTrabajos/JobsFree Fast EstimateLogin Search The Top Choice Team The Top Choice Austin Landscaping Blog Washers and Horseshoes By The Top Choice Team / October 13, 2025 Let’s talk about yard games. I love them. Obsessed.  If I’m at a wedding reception and there’s cornhole or washers out… my wife knows she’s pretty much on her own for the rest of the night. (I know this is not good…sometimes I am actually a good husband).  And now for the fun part: Top… Read More Lawn Fertilization in Austin: Why, When, and How to Do It Right By The Top Choice Team / October 1, 2025 In Austin, fertilizing your lawn isn’t really that optional (unless you don’t want to have a nice yard).  Think of it as feeding your grass the right diet with the proper micro nutrients. Timing, product selection, and application matter a lot more than most people realize. Get it wrong, and you’re wasting money (or worse,… Read More What to do about winter weeds in Austin Texas By The Top Choice Team / September 30, 2025 Many people associate weeds with spring or summer when it seems like everything is coming to life. In fact, there are plenty of winter weeds in Texas that deserve our attention while temperatures are cool. Let’s look into what these weeds are and what you can do about them. Step 1: Identification Most weeds fall… Read More What Is Backflow Prevention — And Why Should Homeowners Care? By The Top Choice Team / September 11, 2025 Short Version: Backflow happens when water flows the wrong way and takes contaminants with it. A backflow prevention device keeps fertilizers, pet waste, pool chemicals, and more out of your drinking water. If you have an irrigation system in Central Texas, this is one of those things you don’t want to ignore. So… What Is… Read More 5 Best Shade Trees for Austin By The Top Choice Team / September 9, 2025 Best Shade Trees for Austin Texas Here are 5 of the best shade trees in Austin and Central Texas. It is hard to say that one is better than another, it really depends on the micro-climate and your specific needs. This is meant to be a quick overview. If you want more information, we are… Read More Types of Grass By The Top Choice Team / March 17, 2025 Central Texas Grass Though we do not think about it much, our climate has a big impact on our life, and your grass is a big part of your personal climate!  In Austin (the southernmost state capital in the US of A!), we have a lot of benefits from our temperate weather.  Sandals and Shorts… Read More Preparing Your Irrigation for Spring By The Top Choice Team / March 7, 2025 Spring is the perfect season to prepare your automatic sprinkler system for effectively watering your lawn and landscape for another year. We suggest looking at your irrigation system at least four times a year. At minimum, one of those should be by a professional. Good times to consider are before starting in spring, before the… Read More Trimming Knock Out Roses in Central Texas. (Video) By The Top Choice Team / February 4, 2025 Wondering how to trim knock out roses in Central Texas? It is important you ensure you are dealing with knockout roses rather than an antique or climbing rose because they are maintained very differently. What are Knock Out Roses? Knock Out® Roses hybrids were developed to resist common rose diseases and produce prolific blooms. Though… Read More How to Prune Crepe Myrtles in Austin Texas (Video) By The Top Choice Team / February 4, 2025 Holly crepe! Is it that time of year again? A little TLC in the winter will pay off big time with healthy growth and beautiful crepe myrtle (crape myrtle) blooms come spring. How do you prune a crepe myrtle? Pruning crepe myrtles is no big secret. Many smaller trees are perfect candidates for a little… Read More How to Winterize Your Backflow Preventer (Video) By The Top Choice Team / January 20, 2025 Folks around the country will often shut off and drain their irrigation systems entirely before the winter, but because we rarely get deep freezes, that’s not really necessary in Central Texas. However, we still need to protect any above-ground exposed equipment: pipes, pumps, filters, and backflow preventers! Proper insulation and winterization are especially important this… Read More 1 2 3 … 12 Next » Load More Search Categories Artificial Turf (4) Crape Myrtle (1) crepe myrtle (1) Design (8) Fertilization and Weed Control (8) General (132) Holidays (3) Irrigation (36) Landscaping (146) Tree and Shrub Fertilization (3) Trees (10) Video (10) Tagsaeration artificial turf Austin Water beds central texas landscaping core aeration cutback debris removal drought-resistant landscaping fall fertilization general landscaping grass heat ice Irrigation landscaping lawn care lawn mowing live oak live oak trees mosquito-repellant plants mowing mulch native landscaping native plants oak wilt planting plants pruning rocks spring summer top dressing trees Tree Stress tree trimming trimming turf water water conservation watering weed control weeds winter Get a quote! Send us a message to get started on your next project. Get a quote Get In Touch! (512) 291-7050 10081 Schmidt Lane Austin, TX 78737 Monday-Thursday, 8:30am-6pmFriday, 8:30am-2pmSaturday & Sunday closed About Us We are a customer service business that happens to do lawn care. We are owned and operated by Austinites committed to making our city beautiful and embracing our common appreciation for the great outdoors. Latest Posts Washers and Horseshoes Top 10 Plants for Xeriscaping in Central Texas Lawn Fertilization in Austin: Why, When, and How to Do It Right Get a Quote! Get a fast free quote from the Top Choice experts. Get a Quote © 2025 Top Choice Lawn Care. All Rights Reserved.  |  Powered by Blue Griffin Marketing",
  "scraped_at": "2025-10-15T22:27:07.868285"
}