{
  "company_name": "Top Choice Lawn Care",
  "url": "https://www.topchoiceaustin.com/",
  "founders": [],
  "team_members": [
    {
      "name": "Lawn Care",
      "title": "MowingEdgingBlowingFertilizationWeed Control",
      "bio": "MowingEdgingBlowingFertilizationWeed Control"
    },
    {
      "name": "Simon",
      "title": "AllisonEstimator Extraordinaire / Horticulture Phenom",
      "bio": "AllisonEstimator Extraordinaire / Horticulture Phenom AllisonEstimator Extraordinaire / Horticulture Phenom AllisonEstimator Extraordinaire / Horticulture Phenom AllisonEstimator Extraordinaire / Horticulture Phenom AllisonEstimator Extraordinaire / Horticulture Phenom"
    },
    {
      "name": "Allison",
      "title": "Estimator Extraordinaire / Horticulture Phenom",
      "bio": "VanessaCustomer Service Manager / The Office Mom VanessaCustomer Service Manager / The Office Mom VanessaCustomer Service Manager / The Office Mom VanessaCustomer Service Manager / The Office Mom VanessaCustomer Service Manager / The Office Mom VanessaCustomer Service Manager / The Office Mom"
    },
    {
      "name": "Vanessa",
      "title": "Customer Service Manager / The Office Mom",
      "bio": ""
    },
    {
      "name": "Aeration:",
      "title": "FULL SCOOP HERE.",
      "bio": ""
    },
    {
      "name": "Washers and Horseshoes",
      "title": "Read More »",
      "bio": "Let’s talk about yard games. I love them. Obsessed.  If I’m at a wedding reception and there’s cornhole or washers out… my wife knows she’s pretty much on her own for the rest of the night. (I know this is not good…sometimes I am actually a good husband).  And now for the fun part: Top… Let’s talk about yard games. I love them. Obsessed.  If I’m at a wedding reception and there’s cornhole or washers out… my wife knows she’s pretty much on her own for the rest of the night. (I know this is not go"
    },
    {
      "name": "ByNolan Gore|October 7, 2025",
      "title": "Read More »",
      "bio": "Lawn Fertilization in Austin: Why, When, and How to Do It RightByThe Top Choice Team|October 1, 2025In Austin, fertilizing your lawn isn’t really that optional (unless you don’t want to have a nice yard).  Think of it as feeding your grass the right diet with the proper micro nutrients. Timing, product selection, and application matter a lot more than most people realize. Get it wrong, and you’re wasting money (or worse,…Read More » Lawn Fertilization in Austin: Why, When, and How to Do It Right"
    },
    {
      "name": "About Us",
      "title": "Latest Posts",
      "bio": "We are a customer service business that happens to do lawn care. We are owned and operated by Austinites committed to making our city beautiful and embracing our common appreciation for the great outdoors. We are a customer service business that happens to do lawn care. We are owned and operated by Austinites committed to making our city beautiful and embracing our common appreciation for the great outdoors. We are a customer service business that happens to do lawn care. We are owned and operat"
    },
    {
      "name": "Latest Posts",
      "title": "Washers and Horseshoes",
      "bio": "Washers and HorseshoesTop 10 Plants for Xeriscaping in Central TexasLawn Fertilization in Austin: Why, When, and How to Do It Right Washers and HorseshoesTop 10 Plants for Xeriscaping in Central TexasLawn Fertilization in Austin: Why, When, and How to Do It Right Washers and HorseshoesTop 10 Plants for Xeriscaping in Central TexasLawn Fertilization in Austin: Why, When, and How to Do It Right Washers and Horseshoes Washers and Horseshoes"
    },
    {
      "name": "Washers and Horseshoes",
      "title": "Top 10 Plants for Xeriscaping in Central Texas",
      "bio": "Top 10 Plants for Xeriscaping in Central Texas Top 10 Plants for Xeriscaping in Central Texas Top 10 Plants for Xeriscaping in Central Texas"
    },
    {
      "name": "Get a Quote!",
      "title": "Get a fast free quote from the Top Choice experts.",
      "bio": "Get a fast free quote from the Top Choice experts. Get a fast free quote from the Top Choice experts. Get a fast free quote from the Top Choice experts. © 2025 Top Choice Lawn Care. All Rights Reserved.  |  Powered byBlue Griffin Marketing © 2025 Top Choice Lawn Care. All Rights Reserved.  |  Powered byBlue Griffin Marketing"
    },
    {
      "name": "The Top Choice Story",
      "title": "",
      "bio": "Top Choice Lawn Care was founded in 2005 with the customer in mind. Throughout the years, the team has refined our processes, services, and area of operations and we now providelawn care,landscaping, andirrigationto the greater part of West Austin as far north as Steiner Ranch and as far south as Buda. We are proud to be local and we are proud to be from Texas. We are veteran-owned and operated. It would be an honor to serve you."
    },
    {
      "name": "Justin",
      "title": "",
      "bio": "JoeKing of the Drive Through / Ops MaestroJoe has a background in the restaurant space. Before joining Top Choice, he ran multiple Chic-fil-a stores in town.When he got tired of Chicken Sandwiches, he decided to try his hand at the lawn and landscape industry where he uses his vast experience with customer service and system efficiencies to make us better every day. JoeKing of the Drive Through / Ops MaestroJoe has a background in the restaurant space. Before joining Top Choice, he ran multiple "
    },
    {
      "name": "Joe",
      "title": "King of the Drive Through / Ops Maestro",
      "bio": "Joe has a background in the restaurant space. Before joining Top Choice, he ran multiple Chic-fil-a stores in town.When he got tired of Chicken Sandwiches, he decided to try his hand at the lawn and landscape industry where he uses his vast experience with customer service and system efficiencies to make us better every day. Joe has a background in the restaurant space. Before joining Top Choice, he ran multiple Chic-fil-a stores in town.When he got tired of Chicken Sandwiches, he decided to try"
    },
    {
      "name": "Scott",
      "title": "Irrigation/ Drip and Drop Master",
      "bio": "Scott has taken our irrigation department to the next level. He has over a decade of experience in the industry - starting in the field digging ditches. Through the years, he has moved through the industry with residential, commercial, and municipal experience. He even worked for the City of Austin for a while.When he isn’t watering the world (with the utmost of water conservation) he can be found rollerblading (he is a master) or helping folks in his neighborhood.We feel so thankful to have him"
    },
    {
      "name": "Vanessa",
      "title": "The Office Mom / Customer Service Manager",
      "bio": "Vanessa is a local *gasp*. They actually exist. And she is one of those locals that has actually done the “Cool Austin Stuff” for a long time. Example: she faithfully attended ACL for many years before it reached national acclaim.She is a wonderful mom to two – dare we say – extremely smart kids. (A random conversation with the 10-year-old may involve the role of the American bill of rights…no joke). And she fills the much-needed role of mother to the office. She is calming and keeps things in p"
    },
    {
      "name": "Myra",
      "title": "Estimators (Landscaping Gurus)",
      "bio": "Estimators (Landscaping Gurus)"
    },
    {
      "name": "Estimators (Landscaping Gurus)",
      "title": "AllisonEstimator Extraordinaire / Horticulture Phenom",
      "bio": ""
    },
    {
      "name": "Allison",
      "title": "Estimator Extraordinaire / Horticulture Phenom",
      "bio": "Formally, she is a certified arborist, so feel free to direct your tree questions her way. See her recognized on ISAhere. SteveThe Gray Fox / \"Been there done that\" / Estimating LegendSteve has been doing landscaping and lawn care in Texas for over 30 years – most of it in Austin. He has spent time at a number of companies around town and has even run his own high-end maintenance company for a number of years. He is quick with a story about his grandmother and her begonias – Spoiler: Steve would"
    },
    {
      "name": "Steve",
      "title": "The Gray Fox / \"Been there done that\" / Estimating Legend",
      "bio": "Steve has been doing landscaping and lawn care in Texas for over 30 years – most of it in Austin. He has spent time at a number of companies around town and has even run his own high-end maintenance company for a number of years. He is quick with a story about his grandmother and her begonias – Spoiler: Steve would save them in burlap sacks through the winter. He is extremely knowledgeable and friendly. If you ever get the chance, have him walk you around your yard – you won’t regret the informa"
    }
  ],
  "testimonials": [],
  "about": "The customer service business for your yard - lawn care, landscaping and irrigation. Get your free fast quote today.",
  "mission": "",
  "contact_info": {
    "phone": "5122917050"
  },
  "scraped_at": "2025-10-15T00:31:22.660972"
}