{
  "company_name": "Top Choice Lawn Care",
  "url": "https://www.topchoiceaustin.com/",
  "founders": [],
  "team_members": [
    {
      "name": "(512) 291-7050",
      "title": "Free Fast Quote",
      "bio": "Free Fast QuoteAboutThe TeamWhat is wrong with my yard?Frequently Asked QuestionsCustomer TestimonialsLandscaping PortfolioLandscaping ProductsLandscaping BlogLawnLandscapingBeds & ShrubsSod & GrassCore AerationTop DressingTree TrimmingMulchFertilization & WeedsBed CreationPlantingTree & Shrub FertilizationPatios & RockArtificial TurfIrrigationHoliday LightsTrabajos/JobsFree Fast EstimateLoginSearch Free Fast QuoteAboutThe TeamWhat is wrong with my yard?Frequently Asked QuestionsCustomer Testimo"
    },
    {
      "name": "Irrigation",
      "title": "Get a free estimate",
      "bio": "A different kind of lawn care companyTired of cheap “cut ‘n run” lawn care services, inexperienced laborers, or companies who won’t call you back? We are too. At Top Choice Lawn Care, we believe everyone deserves quality service and exceptional customer service. It’s just that simple.0+Reviews on Google0+Reviews on Yelp A different kind of lawn care companyTired of cheap “cut ‘n run” lawn care services, inexperienced laborers, or companies who won’t call you back? We are too. At Top Choice Lawn "
    },
    {
      "name": "0+",
      "title": "0+Reviews on Yelp",
      "bio": ""
    },
    {
      "name": "0+",
      "title": "Why Choose Top Choice Lawn Care?",
      "bio": "Why Choose Top Choice Lawn Care?Services for your whole yardWe can handle everything your turf, shrubs, and trees need to be healthy – and make your yard the yard of envy in the neighborhood. At Top Choice Lawn Care, our turf and landscaping experts will provide the best service you’ve experienced, or it’s free.Lawn CareMowingEdgingBlowingFertilizationWeed ControlLandscapingBed maintenanceTreesPlantsSodMuch moreIrrigationRepairsEvaluationsRoutine ProgramsInstallationsBackflow Prevention ChecksGe"
    },
    {
      "name": "Services for your whole yard",
      "title": "Lawn CareMowingEdgingBlowingFertilizationWeed Control",
      "bio": "We can handle everything your turf, shrubs, and trees need to be healthy – and make your yard the yard of envy in the neighborhood. At Top Choice Lawn Care, our turf and landscaping experts will provide the best service you’ve experienced, or it’s free. Lawn CareMowingEdgingBlowingFertilizationWeed ControlLandscapingBed maintenanceTreesPlantsSodMuch moreIrrigationRepairsEvaluationsRoutine ProgramsInstallationsBackflow Prevention Checks Lawn CareMowingEdgingBlowingFertilizationWeed Control Lawn C"
    },
    {
      "name": "Lawn Care",
      "title": "MowingEdgingBlowingFertilizationWeed Control",
      "bio": "MowingEdgingBlowingFertilizationWeed Control LandscapingBed maintenanceTreesPlantsSodMuch more LandscapingBed maintenanceTreesPlantsSodMuch more LandscapingBed maintenanceTreesPlantsSodMuch more"
    },
    {
      "name": "Landscaping",
      "title": "Bed maintenanceTreesPlantsSodMuch more",
      "bio": "Bed maintenanceTreesPlantsSodMuch more IrrigationRepairsEvaluationsRoutine ProgramsInstallationsBackflow Prevention Checks IrrigationRepairsEvaluationsRoutine ProgramsInstallationsBackflow Prevention Checks IrrigationRepairsEvaluationsRoutine ProgramsInstallationsBackflow Prevention Checks"
    },
    {
      "name": "Irrigation",
      "title": "RepairsEvaluationsRoutine ProgramsInstallationsBackflow Prevention Checks",
      "bio": "RepairsEvaluationsRoutine ProgramsInstallationsBackflow Prevention Checks We have fun doing great workWe believe happy people do better work, and that makes customers happy too! We enjoy helping folks and having fun in the great outdoors. We offer reasonable prices, and we pay our folks well.We answer the phone. We do what we say we will do. We own and fix our mistakes (they happen). We’re always improving. We strive to do business with folks for decades, and that only happens when we treat peop"
    },
    {
      "name": "We have fun doing great work",
      "title": "5,000+ happy customers",
      "bio": "We believe happy people do better work, and that makes customers happy too! We enjoy helping folks and having fun in the great outdoors. We offer reasonable prices, and we pay our folks well. We answer the phone. We do what we say we will do. We own and fix our mistakes (they happen). We’re always improving. We strive to do business with folks for decades, and that only happens when we treat people right. 5,000+ happy customers19+ years in businessPart veteran owned50+ uniquely skilled team memb"
    },
    {
      "name": "Lawn Care Solutions",
      "title": "Get a free estimate",
      "bio": "Come home to a beautiful lawn every day, with routine mowing, edging, and blowing services. Our turf experts also offer seasonal fertilization and weed control to keep your lawn looking its best year-round. Our no contract guaranteeWe don't need contracts. We're only happy if you are! Our no contract guaranteeWe don't need contracts. We're only happy if you are! Our no contract guaranteeWe don't need contracts. We're only happy if you are! Our no contract guaranteeWe don't need contracts. We're "
    },
    {
      "name": "Our no contract guarantee",
      "title": "We don't need contracts. We're only happy if you are!",
      "bio": "We don't need contracts. We're only happy if you are! We don't need contracts. We're only happy if you are! Our service areaWe serve most of south, central, and north Austin, including Bee Cave / Lakeway area, West Lake, Oak Hill, Circle C, and more. We recently expanded toserve north Austin, including Cedar Park, Round Rock, and beyond!This map provides a general idea of our service area, but if in doubt, give us a call!(Click to enlarge) Our service areaWe serve most of south, central, and nor"
    },
    {
      "name": "Our service area",
      "title": "(Click to enlarge)",
      "bio": "We serve most of south, central, and north Austin, including Bee Cave / Lakeway area, West Lake, Oak Hill, Circle C, and more. We recently expanded toserve north Austin, including Cedar Park, Round Rock, and beyond! This map provides a general idea of our service area, but if in doubt, give us a call!"
    },
    {
      "name": "(Click to enlarge)",
      "title": "",
      "bio": "Some of our Top Choice smilesWe love to smile, and having fun is part of who we are. You can learn more about us on our team page.SimonMadman with a Mower / Christmas Lighting LegendAllisonEstimator Extraordinaire / Horticulture PhenomVanessaCustomer Service Manager / The Office MomMeet the team Some of our Top Choice smilesWe love to smile, and having fun is part of who we are. You can learn more about us on our team page.SimonMadman with a Mower / Christmas Lighting LegendAllisonEstimator Extr"
    },
    {
      "name": "Some of our Top Choice smiles",
      "title": "SimonMadman with a Mower / Christmas Lighting Legend",
      "bio": "We love to smile, and having fun is part of who we are. You can learn more about us on our team page. SimonMadman with a Mower / Christmas Lighting LegendAllisonEstimator Extraordinaire / Horticulture PhenomVanessaCustomer Service Manager / The Office Mom SimonMadman with a Mower / Christmas Lighting Legend SimonMadman with a Mower / Christmas Lighting Legend SimonMadman with a Mower / Christmas Lighting Legend SimonMadman with a Mower / Christmas Lighting Legend"
    },
    {
      "name": "Simon",
      "title": "Madman with a Mower / Christmas Lighting Legend",
      "bio": "AllisonEstimator Extraordinaire / Horticulture Phenom AllisonEstimator Extraordinaire / Horticulture Phenom AllisonEstimator Extraordinaire / Horticulture Phenom AllisonEstimator Extraordinaire / Horticulture Phenom AllisonEstimator Extraordinaire / Horticulture Phenom AllisonEstimator Extraordinaire / Horticulture Phenom"
    },
    {
      "name": "The Top Choice Story",
      "title": "",
      "bio": "Top Choice Lawn Care was founded in 2005 with the customer in mind. Throughout the years, the team has refined our processes, services, and area of operations and we now providelawn care,landscaping, andirrigationto the greater part of West Austin as far north as Steiner Ranch and as far south as Buda. We are proud to be local and we are proud to be from Texas. We are veteran-owned and operated. It would be an honor to serve you. Our teamNolanGeneral Manager / The Guy that tries to be funny in t"
    },
    {
      "name": "Our team",
      "title": "NolanGeneral Manager / The Guy that tries to be funny in the emails",
      "bio": "NolanGeneral Manager / The Guy that tries to be funny in the emailsNolan was born and raised in Austin. The son of a landscape entrepreneur, he has been around the business since he can remember. Nolan attended Texas A&M university where he graduated with a finance degree and spent many Saturdays disappointed by the football team. After college, Nolan joined the Marine Corps as a combat engineer officer and moved to Virginia. Over four years, he and his wife – Joanie – lived on both coasts, and "
    },
    {
      "name": "Nolan",
      "title": "General Manager / The Guy that tries to be funny in the emails",
      "bio": "Nolan was born and raised in Austin. The son of a landscape entrepreneur, he has been around the business since he can remember. Nolan attended Texas A&M university where he graduated with a finance degree and spent many Saturdays disappointed by the football team. After college, Nolan joined the Marine Corps as a combat engineer officer and moved to Virginia. Over four years, he and his wife – Joanie – lived on both coasts, and he served one tour in Iraq, and had other adventures. Nolan and his"
    },
    {
      "name": "Golden",
      "title": "Operations Manager / The Guy That Actually Makes This Place Run",
      "bio": "Golden hails from a suburb of Salt Lake City.  He is the son of a small-town Idaho farmer.  He graduated twice from Brigham Young University – once as an undergraduate and once as a graduate.  For most of his professional career, he has been involved in sales and service management – overseeing sales professionals, service representatives, underwriters, and even technology resources.  He is our protocol and procedures guru.  Organizing and arranging materials, installations, safety processes – y"
    },
    {
      "name": "Justin",
      "title": "Operations / Fire Lord (He Puts Out Fire)",
      "bio": "Justin makes the trains run on time and does most of our nuts-and-bolts scheduling day to day. (So, if you’re ever annoyed at our scheduling, Justin’s direct phone line is…oh, wait…never mind…oops). When he isn’t arranging huge mulch deliveries or tracking down an exotic plant for your property, Justin also recruits, hires, trains, manages, coaches, etc – all our team.Justin was born and raised in Mexico and speaks fluent Spanish. He later came to the States and graduated from Brigham Young Univ"
    }
  ],
  "testimonials": [],
  "about": "The customer service business for your yard - lawn care, landscaping and irrigation. Get your free fast quote today.",
  "mission": "",
  "contact_info": {
    "phone": "5122917050"
  },
  "scraped_at": "2025-10-15T00:12:22.172593"
}