{
  "company_name": "Top Choice Lawn Care",
  "url": "https://www.topchoiceaustin.com/",
  "founders": [],
  "team_members": [
    {
      "name": "Allison",
      "title": "VanessaCustomer Service Manager / The Office Mom",
      "bio": "VanessaCustomer Service Manager / The Office Mom VanessaCustomer Service Manager / The Office Mom VanessaCustomer Service Manager / The Office Mom VanessaCustomer Service Manager / The Office Mom VanessaCustomer Service Manager / The Office Mom"
    },
    {
      "name": "Vanessa",
      "title": "Customer Service Manager / The Office Mom",
      "bio": ""
    },
    {
      "name": "About Us",
      "title": "Latest Posts",
      "bio": ""
    },
    {
      "name": "Get a Quote!",
      "title": "Get a fast free quote from the Top Choice experts.",
      "bio": "Get a fast free quote from the Top Choice experts. Get a fast free quote from the Top Choice experts. Get a fast free quote from the Top Choice experts."
    },
    {
      "name": "Joe",
      "title": "King of the Drive Through / Ops Maestro",
      "bio": "ScottIrrigation/ Drip and Drop MasterScott has taken our irrigation department to the next level. He has over a decade of experience in the industry - starting in the field digging ditches. Through the years, he has moved through the industry with residential, commercial, and municipal experience. He even worked for the City of Austin for a while.When he isn’t watering the world (with the utmost of water conservation) he can be found rollerblading (he is a master) or helping folks in his neighbo"
    },
    {
      "name": "Scott",
      "title": "",
      "bio": "Scott has taken our irrigation department to the next level. He has over a decade of experience in the industry - starting in the field digging ditches. Through the years, he has moved through the industry with residential, commercial, and municipal experience. He even worked for the City of Austin for a while.When he isn’t watering the world (with the utmost of water conservation) he can be found rollerblading (he is a master) or helping folks in his neighborhood.We feel so thankful to have him"
    },
    {
      "name": "Vanessa",
      "title": "The Office Mom / Customer Service Manager",
      "bio": "Vanessa is a local *gasp*. They actually exist. And she is one of those locals that has actually done the “Cool Austin Stuff” for a long time. Example: she faithfully attended ACL for many years before it reached national acclaim.She is a wonderful mom to two – dare we say – extremely smart kids. (A random conversation with the 10-year-old may involve the role of the American bill of rights…no joke). And she fills the much-needed role of mother to the office. She is calming and keeps things in p"
    },
    {
      "name": "Steve",
      "title": "We are blessed and grateful to have Steve on the team.",
      "bio": "LisaThe one and only “Lady Landscaping”Lisa joined the team in early 2024. But that wasn’t the beginning of her adventures in landscaping.For several years she owned and operated her own company - and did much of the work herself.Since then, she has been a super mom, an elementary teacher, a school librarian and a realtor.We are grateful to have another capable and strong-willed lady grace our team (and put Nolan in his place). LisaThe one and only “Lady Landscaping”Lisa joined the team in early"
    },
    {
      "name": "Lisa",
      "title": "",
      "bio": "Lisa joined the team in early 2024. But that wasn’t the beginning of her adventures in landscaping.For several years she owned and operated her own company - and did much of the work herself.Since then, she has been a super mom, an elementary teacher, a school librarian and a realtor.We are grateful to have another capable and strong-willed lady grace our team (and put Nolan in his place). Lisa joined the team in early 2024. But that wasn’t the beginning of her adventures in landscaping.For seve"
    },
    {
      "name": "5 Best Shade Trees for Austin",
      "title": "ByThe Top Choice Team/September 9, 2025",
      "bio": "Best Shade Trees for Austin Texas Here are 5 of the best shade trees in Austin and Central Texas. It is hard to say that one is better than another, it really depends on the micro-climate and your specific needs. This is meant to be a quick overview. If you want more information, we are…"
    },
    {
      "name": "Types of Grass",
      "title": "",
      "bio": "Central Texas Grass Though we do not think about it much, our climate has a big impact on our life, and your grass is a big part of your personal climate!  In Austin (the southernmost state capital in the US of A!), we have a lot of benefits from our temperate weather.  Sandals and Shorts…"
    },
    {
      "name": "Tags",
      "title": "Get a quote!",
      "bio": ""
    },
    {
      "name": "Get a quote!",
      "title": "Send us a message to get started on your next project.",
      "bio": "Send us a message to get started on your next project. Send us a message to get started on your next project. Send us a message to get started on your next project."
    }
  ],
  "testimonials": [],
  "about": "The customer service business for your yard - lawn care, landscaping and irrigation. Get your free fast quote today.",
  "mission": "",
  "contact_info": {
    "phone": "5122917050"
  },
  "scraped_at": "2025-10-15T00:32:37.192247"
}